src/main/resources/template/templateCreateConsultationLogRequest.groovy

<soapenv:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="https://www.marches-securises.fr/webserv/">\n   <soapenv:Header/>\n   <soapenv:Body>\n      <web:creer_consultation_log soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">\n         <login xsi:type="xsd:string">$login</login>\n         <password xsi:type="xsd:string">$password</password>\n         <pa xsi:type="xsd:string">$pa</pa>\n      </web:creer_consultation_log>\n   </soapenv:Body>\n</soapenv:Envelope>